; domain
(define (domain logistics)
(:requirements :strips) 
 
(:predicates 	
  (package ?obj)
  (truck ?truck)
  (airplane ?airplane)
  (airport ?airport)
  (location ?loc)
  (in_city ?obj ?city)
  (city ?city)
  (at ?obj ?loc)
  (in ?obj ?obj)
  (human ?human)
  (balanced ?airplane)
)

(:action call_human
  :parameters
   (?human
    ?truck
    ?loc)
  :precondition
   (and (human ?human) (truck ?truck) (location ?loc)
   (at ?human ?loc) (at ?truck ?loc))
  :effect
   (and (not (at ?human ?loc)) (at ?human ?truck)))

(:action load_truck_human
  :parameters
   (?human
    ?obj
    ?truck
    ?loc)
  :precondition
   (and (package ?obj) (truck ?truck) (location ?loc)
   (at ?truck ?loc) (at ?obj ?loc) (human ?human) (at ?human ?truck))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (not (at ?human ?truck)) (at ?human ?loc)))
 
(:action load_truck
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (package ?obj) (truck ?truck) (location ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action load_airplane
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (package ?obj) (airplane ?airplane) (location ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action unload_truck
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (package ?obj) (truck ?truck) (location ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action unload_truck_human
  :parameters
   (?human
    ?obj
    ?truck
    ?loc)
  :precondition
   (and (package ?obj) (truck ?truck) (location ?loc)
        (at ?truck ?loc) (in ?obj ?truck) (human ?human) (at ?human ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (not (at ?human ?truck)) (at ?human ?loc)))

(:action unload_airplane
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (package ?obj) (airplane ?airplane) (location ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action drive_truck
  :parameters
   (?truck
    ?loc_from
    ?loc_to
    ?city)
  :precondition
   (and (truck ?truck) (location ?loc_from) (location ?loc_to) (city ?city)
   (at ?truck ?loc_from)
   (in_city ?loc_from ?city)
   (in_city ?loc_to ?city))
  :effect
   (and (not (at ?truck ?loc_from)) (at ?truck ?loc_to)))

(:action fly_airplane
  :parameters
   (?airplane
    ?loc_from
    ?loc_to)
  :precondition
   (and (airplane ?airplane) (airport ?loc_from) (airport ?loc_to)
	(at ?airplane ?loc_from) (balanced ?airplane))
  :effect
   (and (not (at ?airplane ?loc_from)) (at ?airplane ?loc_to)))

  (:action balance_airplane
  :parameters
   (?airplane)
  :precondition
   ()
  :effect
   (balanced ?airplane))
)

; problem
(define (problem logistics-10-0)
(:domain logistics)
(:objects apn1 apt4 pos4 apt3 pos3 apt2 pos2 apt1 pos1 cit4 cit3 cit2 cit1 tru4 tru3 tru2 tru1 obj43 obj42 obj41 obj33 obj32 obj31 obj23 obj22 obj21 obj13 obj12 obj11 human1 human2 human3 human4 human5 human6 human7 human8)
(:init (package obj11) (package obj12) (package obj13) (package obj21)
 (package obj22) (package obj23) (package obj31) (package obj32) (package obj33)
 (package obj41) (package obj42) (package obj43) (truck tru1) (truck tru2)
 (truck tru3) (truck tru4) (city cit1) (city cit2) (city cit3) (city cit4)
 (location pos1) (location apt1) (location pos2) (location apt2) (location pos3)
 (location apt3) (location pos4) (location apt4) (airport apt1) (airport apt2)
 (airport apt3) (airport apt4) (airplane apn1) (at apn1 apt1) (at tru1 pos1)
 (at obj11 pos1) (at obj12 pos1) (at obj13 pos1) (at tru2 pos2) (at obj21 pos2)
 (at obj22 pos2) (at obj23 pos2) (at tru3 pos3) (at obj31 pos3) (at obj32 pos3)
 (at obj33 pos3) (at tru4 pos4) (at obj41 pos4) (at obj42 pos4) (at obj43 pos4)
 (in_city pos1 cit1) (in_city apt1 cit1) (in_city pos2 cit2) (in_city apt2 cit2)
 (in_city pos3 cit3) (in_city apt3 cit3) (in_city pos4 cit4) (in_city apt4 cit4)
 (balanced apn1)
 (human human1) (human human2) (human human3) (human human4) (human human5) 
 (human human6) (human human7) (human human8) (at human1 pos1) (at human2 pos2)
 (at human3 pos3) (at human4 pos4) (at human5 apt1) (at human6 apt2) (at human7 apt3)
 (at human8 apt4))
(:goal (and (at obj31 pos3) (at obj33 apt3) (at obj41 apt3) (at obj23 pos4)
            (at obj11 pos3) (at obj22 apt2) (at obj12 apt1) (at obj21 pos4)
            (at obj42 pos4) (at obj32 pos1)))
)

; plan
1. (load_truck obj41 tru4 pos4)
   deleted: (at obj41 pos4)
   added: (in obj41 tru4)
   goals met: 2 of 10
2. (load_truck obj33 tru3 pos3)
   deleted: (at obj33 pos3)
   added: (in obj33 tru3)
   goals met: 2 of 10
3. (load_truck obj32 tru3 pos3)
   deleted: (at obj32 pos3)
   added: (in obj32 tru3)
   goals met: 2 of 10
4. (load_truck obj23 tru2 pos2)
   deleted: (at obj23 pos2)
   added: (in obj23 tru2)
   goals met: 2 of 10
5. (load_truck obj22 tru2 pos2)
   deleted: (at obj22 pos2)
   added: (in obj22 tru2)
   goals met: 2 of 10
6. (load_truck obj21 tru2 pos2)
   deleted: (at obj21 pos2)
   added: (in obj21 tru2)
   goals met: 2 of 10
7. (drive_truck tru2 pos2 apt2 cit2)
   deleted: (at tru2 pos2)
   added: (at tru2 apt2)
   goals met: 2 of 10
8. (unload_truck obj23 tru2 apt2)
   deleted: (in obj23 tru2)
   added: (at obj23 apt2)
   goals met: 2 of 10
9. (unload_truck obj22 tru2 apt2)
   deleted: (in obj22 tru2)
   added: (at obj22 apt2)
   goals met: 3 of 10
10. (unload_truck obj21 tru2 apt2)
   deleted: (in obj21 tru2)
   added: (at obj21 apt2)
   goals met: 3 of 10
11. (load_truck obj12 tru1 pos1)
   deleted: (at obj12 pos1)
   added: (in obj12 tru1)
   goals met: 3 of 10
12. (load_truck obj11 tru1 pos1)
   deleted: (at obj11 pos1)
   added: (in obj11 tru1)
   goals met: 3 of 10
13. (drive_truck tru4 pos4 apt4 cit4)
   deleted: (at tru4 pos4)
   added: (at tru4 apt4)
   goals met: 3 of 10
14. (unload_truck obj41 tru4 apt4)
   deleted: (in obj41 tru4)
   added: (at obj41 apt4)
   goals met: 3 of 10
15. (drive_truck tru3 pos3 apt3 cit3)
   deleted: (at tru3 pos3)
   added: (at tru3 apt3)
   goals met: 3 of 10
16. (unload_truck obj33 tru3 apt3)
   deleted: (in obj33 tru3)
   added: (at obj33 apt3)
   goals met: 4 of 10
17. (unload_truck obj32 tru3 apt3)
   deleted: (in obj32 tru3)
   added: (at obj32 apt3)
   goals met: 4 of 10
18. (drive_truck tru1 pos1 apt1 cit1)
   deleted: (at tru1 pos1)
   added: (at tru1 apt1)
   goals met: 4 of 10
19. (unload_truck obj12 tru1 apt1)
   deleted: (in obj12 tru1)
   added: (at obj12 apt1)
   goals met: 5 of 10
20. (unload_truck obj11 tru1 apt1)
   deleted: (in obj11 tru1)
   added: (at obj11 apt1)
   goals met: 5 of 10
21. (load_airplane obj11 apn1 apt1)
   deleted: (at obj11 apt1)
   added: (in obj11 apn1)
   goals met: 5 of 10
22. (fly_airplane apn1 apt1 apt2)
   deleted: (at apn1 apt1)
   added: (at apn1 apt2)
   goals met: 5 of 10
23. (load_airplane obj23 apn1 apt2)
   deleted: (at obj23 apt2)
   added: (in obj23 apn1)
   goals met: 5 of 10
24. (load_airplane obj21 apn1 apt2)
   deleted: (at obj21 apt2)
   added: (in obj21 apn1)
   goals met: 5 of 10
25. (fly_airplane apn1 apt2 apt1)
   deleted: (at apn1 apt2)
   added: (at apn1 apt1)
   goals met: 5 of 10
26. (fly_airplane apn1 apt1 apt3)
   deleted: (at apn1 apt1)
   added: (at apn1 apt3)
   goals met: 5 of 10
27. (load_airplane obj32 apn1 apt3)
   deleted: (at obj32 apt3)
   added: (in obj32 apn1)
   goals met: 5 of 10
28. (unload_airplane obj11 apn1 apt3)
   deleted: (in obj11 apn1)
   added: (at obj11 apt3)
   goals met: 5 of 10
29. (load_truck obj11 tru3 apt3)
   deleted: (at obj11 apt3)
   added: (in obj11 tru3)
   goals met: 5 of 10
30. (drive_truck tru3 apt3 pos3 cit3)
   deleted: (at tru3 apt3)
   added: (at tru3 pos3)
   goals met: 5 of 10
31. (unload_truck obj11 tru3 pos3)
   deleted: (in obj11 tru3)
   added: (at obj11 pos3)
   goals met: 6 of 10
32. (fly_airplane apn1 apt3 apt1)
   deleted: (at apn1 apt3)
   added: (at apn1 apt1)
   goals met: 6 of 10
33. (unload_airplane obj32 apn1 apt1)
   deleted: (in obj32 apn1)
   added: (at obj32 apt1)
   goals met: 6 of 10
34. (load_truck obj32 tru1 apt1)
   deleted: (at obj32 apt1)
   added: (in obj32 tru1)
   goals met: 6 of 10
35. (drive_truck tru1 apt1 pos1 cit1)
   deleted: (at tru1 apt1)
   added: (at tru1 pos1)
   goals met: 6 of 10
36. (unload_truck obj32 tru1 pos1)
   deleted: (in obj32 tru1)
   added: (at obj32 pos1)
   goals met: 7 of 10
37. (fly_airplane apn1 apt1 apt3)
   deleted: (at apn1 apt1)
   added: (at apn1 apt3)
   goals met: 7 of 10
38. (fly_airplane apn1 apt3 apt4)
   deleted: (at apn1 apt3)
   added: (at apn1 apt4)
   goals met: 7 of 10
39. (load_airplane obj41 apn1 apt4)
   deleted: (at obj41 apt4)
   added: (in obj41 apn1)
   goals met: 7 of 10
40. (unload_airplane obj23 apn1 apt4)
   deleted: (in obj23 apn1)
   added: (at obj23 apt4)
   goals met: 7 of 10
41. (load_truck obj23 tru4 apt4)
   deleted: (at obj23 apt4)
   added: (in obj23 tru4)
   goals met: 7 of 10
42. (unload_airplane obj21 apn1 apt4)
   deleted: (in obj21 apn1)
   added: (at obj21 apt4)
   goals met: 7 of 10
43. (load_truck obj21 tru4 apt4)
   deleted: (at obj21 apt4)
   added: (in obj21 tru4)
   goals met: 7 of 10
44. (drive_truck tru4 apt4 pos4 cit4)
   deleted: (at tru4 apt4)
   added: (at tru4 pos4)
   goals met: 7 of 10
45. (unload_truck obj23 tru4 pos4)
   deleted: (in obj23 tru4)
   added: (at obj23 pos4)
   goals met: 8 of 10
46. (unload_truck obj21 tru4 pos4)
   deleted: (in obj21 tru4)
   added: (at obj21 pos4)
   goals met: 9 of 10
47. (fly_airplane apn1 apt4 apt3)
   deleted: (at apn1 apt4)
   added: (at apn1 apt3)
   goals met: 9 of 10
48. (unload_airplane obj41 apn1 apt3)
   deleted: (in obj41 apn1)
   added: (at obj41 apt3)
   goals met: 10 of 10
